In [1]:
#Now we'll learn about Selecting Entries
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
#Lets try some Series indexing
ser1 = Series(np.arange(3),index=['A','B','C'])

#multiply all values by 2, to avoid confusion in future
ser1 = 2*ser1

#Show
ser1

A    0
B    2
C    4
dtype: int32

In [3]:
#Can grab entry by index name
ser1['B']

2

In [4]:
#Or grab by index 
ser1[1]

2

In [5]:
#Can also grab by index range
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [6]:
#Or grab range by range of index values
ser1[['A','B','C']]

A    0
B    2
C    4
dtype: int32

In [7]:
#Or grab by logic
ser1[ser1>3]

C    4
dtype: int32

In [8]:
#Can also ser using these methods
ser1[ser1>3] = 10

#Show
ser1

A     0
B     2
C    10
dtype: int32

In [9]:
#Now let's see sleection in a DataFrame

dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])

#Show
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [10]:
#Select by column name
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [11]:
#Select by multiple columns
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [12]:
#Can also use boolean
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [13]:
#Can also just show a boolean DataFrame
dframe> 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [26]:
#Can alos use loc as previously discussed to label-index
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [32]:
#Another example of the same thing as above
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32